hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_adc.h
// SMPR2 Configuration

#define	ADC_SMPR2_SMP19					(0x7u<<27)
#define	ADC_SMPR2_SMP19_0				(0x1u<<27)
#define	ADC_SMPR2_SMP18					(0x7u<<24)
#define	ADC_SMPR2_SMP18_0				(0x1u<<24)
#define	ADC_SMPR2_SMP17					(0x7u<<21)
#define	ADC_SMPR2_SMP17_0				(0x1u<<21)
#define	ADC_SMPR2_SMP16					(0x7u<<18)
#define	ADC_SMPR2_SMP16_0				(0x1u<<18)
#define	ADC_SMPR2_SMP15					(0x7u<<15)
#define	ADC_SMPR2_SMP15_0				(0x1u<<15)
#define	ADC_SMPR2_SMP14					(0x7u<<12)
#define	ADC_SMPR2_SMP14_0				(0x1u<<12)
#define	ADC_SMPR2_SMP13					(0x7u<<9)
#define	ADC_SMPR2_SMP13_0				(0x1u<<9)
#define	ADC_SMPR2_SMP12					(0x7u<<6)
#define	ADC_SMPR2_SMP12_0				(0x1u<<6)
#define	ADC_SMPR2_SMP11					(0x7u<<3)
#define	ADC_SMPR2_SMP11_0				(0x1u<<3)
#define	ADC_SMPR2_SMP10					(0x7u<<0)
#define	ADC_SMPR2_SMP10_0				(0x1u<<0)

#define	ADC_SMPR2_SMP19_B_0X0			(0x0u<<27)
#define	ADC_SMPR2_SMP19_B_0X1			(0x1u<<27)
#define	ADC_SMPR2_SMP19_B_0X2			(0x2u<<27)
#define	ADC_SMPR2_SMP19_B_0X3			(0x3u<<27)
#define	ADC_SMPR2_SMP19_B_0X4			(0x4u<<27)
#define	ADC_SMPR2_SMP19_B_0X5			(0x5u<<27)
#define	ADC_SMPR2_SMP19_B_0X6			(0x6u<<27)
#define	ADC_SMPR2_SMP19_B_0X7			(0x7u<<27)
#define	ADC_SMPR2_SMP18_B_0X0			(0x0u<<24)
#define	ADC_SMPR2_SMP18_B_0X1			(0x1u<<24)
#define	ADC_SMPR2_SMP18_B_0X2			(0x2u<<24)
#define	ADC_SMPR2_SMP18_B_0X3			(0x3u<<24)
#define	ADC_SMPR2_SMP18_B_0X4			(0x4u<<24)
#define	ADC_SMPR2_SMP18_B_0X5			(0x5u<<24)
#define	ADC_SMPR2_SMP18_B_0X6			(0x6u<<24)
#define	ADC_SMPR2_SMP18_B_0X7			(0x7u<<24)
#define	ADC_SMPR2_SMP17_B_0X0			(0x0u<<21)
#define	ADC_SMPR2_SMP17_B_0X1			(0x1u<<21)
#define	ADC_SMPR2_SMP17_B_0X2			(0x2u<<21)
#define	ADC_SMPR2_SMP17_B_0X3			(0x3u<<21)
#define	ADC_SMPR2_SMP17_B_0X4			(0x4u<<21)
#define	ADC_SMPR2_SMP17_B_0X5			(0x5u<<21)
#define	ADC_SMPR2_SMP17_B_0X6			(0x6u<<21)
#define	ADC_SMPR2_SMP17_B_0X7			(0x7u<<21)
#define	ADC_SMPR2_SMP16_B_0X0			(0x0u<<18)
#define	ADC_SMPR2_SMP16_B_0X1			(0x1u<<18)
#define	ADC_SMPR2_SMP16_B_0X2			(0x2u<<18)
#define	ADC_SMPR2_SMP16_B_0X3			(0x3u<<18)
#define	ADC_SMPR2_SMP16_B_0X4			(0x4u<<18)
#define	ADC_SMPR2_SMP16_B_0X5			(0x5u<<18)
#define	ADC_SMPR2_SMP16_B_0X6			(0x6u<<18)
#define	ADC_SMPR2_SMP16_B_0X7			(0x7u<<18)
#define	ADC_SMPR2_SMP15_B_0X0			(0x0u<<15)
#define	ADC_SMPR2_SMP15_B_0X1			(0x1u<<15)
#define	ADC_SMPR2_SMP15_B_0X2			(0x2u<<15)
#define	ADC_SMPR2_SMP15_B_0X3			(0x3u<<15)
#define	ADC_SMPR2_SMP15_B_0X4			(0x4u<<15)
#define	ADC_SMPR2_SMP15_B_0X5			(0x5u<<15)
#define	ADC_SMPR2_SMP15_B_0X6			(0x6u<<15)
#define	ADC_SMPR2_SMP15_B_0X7			(0x7u<<15)
#define	ADC_SMPR2_SMP14_B_0X0			(0x0u<<12)
#define	ADC_SMPR2_SMP14_B_0X1			(0x1u<<12)
#define	ADC_SMPR2_SMP14_B_0X2			(0x2u<<12)
#define	ADC_SMPR2_SMP14_B_0X3			(0x3u<<12)
#define	ADC_SMPR2_SMP14_B_0X4			(0x4u<<12)
#define	ADC_SMPR2_SMP14_B_0X5			(0x5u<<12)
#define	ADC_SMPR2_SMP14_B_0X6			(0x6u<<12)
#define	ADC_SMPR2_SMP14_B_0X7			(0x7u<<12)
#define	ADC_SMPR2_SMP13_B_0X0			(0x0u<<9)
#define	ADC_SMPR2_SMP13_B_0X1			(0x1u<<9)
#define	ADC_SMPR2_SMP13_B_0X2			(0x2u<<9)
#define	ADC_SMPR2_SMP13_B_0X3			(0x3u<<9)
#define	ADC_SMPR2_SMP13_B_0X4			(0x4u<<9)
#define	ADC_SMPR2_SMP13_B_0X5			(0x5u<<9)
#define	ADC_SMPR2_SMP13_B_0X6			(0x6u<<9)
#define	ADC_SMPR2_SMP13_B_0X7			(0x7u<<9)
#define	ADC_SMPR2_SMP12_B_0X0			(0x0u<<6)
#define	ADC_SMPR2_SMP12_B_0X1			(0x1u<<6)
#define	ADC_SMPR2_SMP12_B_0X2			(0x2u<<6)
#define	ADC_SMPR2_SMP12_B_0X3			(0x3u<<6)
#define	ADC_SMPR2_SMP12_B_0X4			(0x4u<<6)
#define	ADC_SMPR2_SMP12_B_0X5			(0x5u<<6)
#define	ADC_SMPR2_SMP12_B_0X6			(0x6u<<6)
#define	ADC_SMPR2_SMP12_B_0X7			(0x7u<<6)
#define	ADC_SMPR2_SMP11_B_0X0			(0x0u<<3)
#define	ADC_SMPR2_SMP11_B_0X1			(0x1u<<3)
#define	ADC_SMPR2_SMP11_B_0X2			(0x2u<<3)
#define	ADC_SMPR2_SMP11_B_0X3			(0x3u<<3)
#define	ADC_SMPR2_SMP11_B_0X4			(0x4u<<3)
#define	ADC_SMPR2_SMP11_B_0X5			(0x5u<<3)
#define	ADC_SMPR2_SMP11_B_0X6			(0x6u<<3)
#define	ADC_SMPR2_SMP11_B_0X7			(0x7u<<3)
#define	ADC_SMPR2_SMP10_B_0X0			(0x0u<<0)
#define	ADC_SMPR2_SMP10_B_0X1			(0x1u<<0)
#define	ADC_SMPR2_SMP10_B_0X2			(0x2u<<0)
#define	ADC_SMPR2_SMP10_B_0X3			(0x3u<<0)
#define	ADC_SMPR2_SMP10_B_0X4			(0x4u<<0)
#define	ADC_SMPR2_SMP10_B_0X5			(0x5u<<0)
#define	ADC_SMPR2_SMP10_B_0X6			(0x6u<<0)
#define	ADC_SMPR2_SMP10_B_0X7			(0x7u<<0)

// PCSEL Configuration

#define	ADC_PCSEL_PCSEL					(0xFFFFFu<<0)
#define	ADC_PCSEL_PCSEL_0				(0x1u<<0)

#define	ADC_PCSEL_PCSEL_B_0X0			(0x0u<<0)
#define	ADC_PCSEL_PCSEL_B_0X1			(0x1u<<0)

// SQR1 Configuration

#define	ADC_SQR1_SQ4					(0x1Fu<<24)
#define	ADC_SQR1_SQ4_0					(0x1u<<24)
#define	ADC_SQR1_SQ3					(0x1Fu<<18)
#define	ADC_SQR1_SQ3_0					(0x1u<<18)
#define	ADC_SQR1_SQ2					(0x1Fu<<12)
#define	ADC_SQR1_SQ2_0					(0x1u<<12)
#define	ADC_SQR1_SQ1					(0x1Fu<<6)
#define	ADC_SQR1_SQ1_0					(0x1u<<6)
#define	ADC_SQR1_L						(0xFu<<0)
#define	ADC_SQR1_L_0					(0x1u<<0)

#define	ADC_SQR1_L_B_0X0				(0x0u<<0)
#define	ADC_SQR1_L_B_0X1				(0x1u<<0)
#define	ADC_SQR1_L_B_0XF				(0xFu<<0)

// SQR2 Configuration

#define	ADC_SQR2_SQ9					(0x1Fu<<24)
#define	ADC_SQR2_SQ9_0					(0x1u<<24)
#define	ADC_SQR2_SQ8					(0x1Fu<<18)
#define	ADC_SQR2_SQ8_0					(0x1u<<18)
#define	ADC_SQR2_SQ7					(0x1Fu<<12)
#define	ADC_SQR2_SQ7_0					(0x1u<<12)
#define	ADC_SQR2_SQ6					(0x1Fu<<6)
#define	ADC_SQR2_SQ6_0					(0x1u<<6)
#define	ADC_SQR2_SQ5					(0x1Fu<<0)
#define	ADC_SQR2_SQ5_0					(0x1u<<0)

// SQR3 Configuration

#define	ADC_SQR3_SQ14					(0x1Fu<<24)
#define	ADC_SQR3_SQ14_0					(0x1u<<24)
#define	ADC_SQR3_SQ13					(0x1Fu<<18)
#define	ADC_SQR3_SQ13_0					(0x1u<<18)
#define	ADC_SQR3_SQ12					(0x1Fu<<12)
#define	ADC_SQR3_SQ12_0					(0x1u<<12)
#define	ADC_SQR3_SQ11					(0x1Fu<<6)
#define	ADC_SQR3_SQ11_0					(0x1u<<6)
#define	ADC_SQR3_SQ10					(0x1Fu<<0)
#define	ADC_SQR3_SQ10_0					(0x1u<<0)

// SQR4 Configuration

#define	ADC_SQR4_SQ16					(0x1Fu<<6)
#define	ADC_SQR4_SQ16_0					(0x1u<<6)
#define	ADC_SQR4_SQ15					(0x1Fu<<0)
#define	ADC_SQR4_SQ15_0					(0x1u<<0)

// DR Configuration

#define	ADC_DR_RDATA					(0xFFFFFFFFu<<0)
#define	ADC_DR_RDATA_0					(0x1u<<0)

// JSQR Configuration

#define	ADC_JSQR_JSQ4					(0x1Fu<<27)
#define	ADC_JSQR_JSQ4_0					(0x1u<<27)
#define	ADC_JSQR_JSQ3					(0x1Fu<<21)
#define	ADC_JSQR_JSQ3_0					(0x1u<<21)
#define	ADC_JSQR_JSQ2					(0x1Fu<<15)
#define	ADC_JSQR_JSQ2_0					(0x1u<<15)
#define	ADC_JSQR_JSQ1					(0x1Fu<<9)
#define	ADC_JSQR_JSQ1_0					(0x1u<<9)
#define	ADC_JSQR_JEXTEN					(0x3u<<7)
#define	ADC_JSQR_JEXTEN_0				(0x1u<<7)
#define	ADC_JSQR_JEXTSEL				(0x1Fu<<2)
#define	ADC_JSQR_JEXTSEL_0				(0x1u<<2)
#define	ADC_JSQR_JL						(0x3u<<0)
#define	ADC_JSQR_JL_0					(0x1u<<0)

#define	ADC_JSQR_JEXTEN_B_0X0			(0x0u<<7)
#define	ADC_JSQR_JEXTEN_B_0X1			(0x1u<<7)
#define	ADC_JSQR_JEXTEN_B_0X2			(0x2u<<7)
#define	ADC_JSQR_JEXTEN_B_0X3			(0x3u<<7)
#define	ADC_JSQR_JEXTSEL_B_0X0			(0x0u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X1			(0x1u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X2			(0x2u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X3			(0x3u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X4			(0x4u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X5			(0x5u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X6			(0x6u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X7			(0x7u<<2)
#define	ADC_JSQR_JEXTSEL_B_0X1F			(0x1Fu<<2)
#define	ADC_JSQR_JL_B_0X0				(0x0u<<0)
#define	ADC_JSQR_JL_B_0X1				(0x1u<<0)
#define	ADC_JSQR_JL_B_0X2				(0x2u<<0)
#define	ADC_JSQR_JL_B_0X3				(0x3u<<0)

// OFCFGR1 Configuration

#define	ADC_OFCFGR1_OFFSET_CH			(0x1Fu<<27)
#define	ADC_OFCFGR1_OFFSET_CH_0			(0x1u<<27)
#define	ADC_OFCFGR1_SSAT				(0x1u<<26)
#define	ADC_OFCFGR1_USAT				(0x1u<<25)
#define	ADC_OFCFGR1_POSOFF				(0x1u<<24)

#define	ADC_OFCFGR1_SSAT_B_0X0			(0x0u<<26)
#define	ADC_OFCFGR1_SSAT_B_0X1			(0x1u<<26)
#define	ADC_OFCFGR1_USAT_B_0X0			(0x0u<<25)
#define	ADC_OFCFGR1_USAT_B_0X1			(0x1u<<25)
#define	ADC_OFCFGR1_POSOFF_B_0X0		(0x0u<<24)
#define	ADC_OFCFGR1_POSOFF_B_0X1		(0x1u<<24)

