hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_adc.h
// OFCFGR2 Configuration

#define	ADC_OFCFGR2_OFFSET_CH			(0x1Fu<<27)
#define	ADC_OFCFGR2_OFFSET_CH_0			(0x1u<<27)
#define	ADC_OFCFGR2_SSAT				(0x1u<<26)
#define	ADC_OFCFGR2_USAT				(0x1u<<25)
#define	ADC_OFCFGR2_POSOFF				(0x1u<<24)

#define	ADC_OFCFGR2_SSAT_B_0X0			(0x0u<<26)
#define	ADC_OFCFGR2_SSAT_B_0X1			(0x1u<<26)
#define	ADC_OFCFGR2_USAT_B_0X0			(0x0u<<25)
#define	ADC_OFCFGR2_USAT_B_0X1			(0x1u<<25)
#define	ADC_OFCFGR2_POSOFF_B_0X0		(0x0u<<24)
#define	ADC_OFCFGR2_POSOFF_B_0X1		(0x1u<<24)

// OFCFGR3 Configuration

#define	ADC_OFCFGR3_OFFSET_CH			(0x1Fu<<27)
#define	ADC_OFCFGR3_OFFSET_CH_0			(0x1u<<27)
#define	ADC_OFCFGR3_SSAT				(0x1u<<26)
#define	ADC_OFCFGR3_USAT				(0x1u<<25)
#define	ADC_OFCFGR3_POSOFF				(0x1u<<24)

#define	ADC_OFCFGR3_SSAT_B_0X0			(0x0u<<26)
#define	ADC_OFCFGR3_SSAT_B_0X1			(0x1u<<26)
#define	ADC_OFCFGR3_USAT_B_0X0			(0x0u<<25)
#define	ADC_OFCFGR3_USAT_B_0X1			(0x1u<<25)
#define	ADC_OFCFGR3_POSOFF_B_0X0		(0x0u<<24)
#define	ADC_OFCFGR3_POSOFF_B_0X1		(0x1u<<24)

// OFCFGR4 Configuration

#define	ADC_OFCFGR4_OFFSET_CH			(0x1Fu<<27)
#define	ADC_OFCFGR4_OFFSET_CH_0			(0x1u<<27)
#define	ADC_OFCFGR4_SSAT				(0x1u<<26)
#define	ADC_OFCFGR4_USAT				(0x1u<<25)
#define	ADC_OFCFGR4_POSOFF				(0x1u<<24)

#define	ADC_OFCFGR4_SSAT_B_0X0			(0x0u<<26)
#define	ADC_OFCFGR4_SSAT_B_0X1			(0x1u<<26)
#define	ADC_OFCFGR4_USAT_B_0X0			(0x0u<<25)
#define	ADC_OFCFGR4_USAT_B_0X1			(0x1u<<25)
#define	ADC_OFCFGR4_POSOFF_B_0X0		(0x0u<<24)
#define	ADC_OFCFGR4_POSOFF_B_0X1		(0x1u<<24)

// OFR1 Configuration

#define	ADC_OFR1_OFFSET					(0x3FFFFFu<<0)
#define	ADC_OFR1_OFFSET_0				(0x1u<<0)

// OFR2 Configuration

#define	ADC_OFR2_OFFSET					(0x3FFFFFu<<0)
#define	ADC_OFR2_OFFSET_0				(0x1u<<0)

// OFR3 Configuration

#define	ADC_OFR3_OFFSET					(0x3FFFFFu<<0)
#define	ADC_OFR3_OFFSET_0				(0x1u<<0)

// OFR4 Configuration

#define	ADC_OFR4_OFFSET					(0x3FFFFFu<<0)
#define	ADC_OFR4_OFFSET_0				(0x1u<<0)

// GCOMP Configuration

#define	ADC_GCOMP_GCOMP					(0x1u<<31)
#define	ADC_GCOMP_GCOMPCOEFF			(0x3FFFu<<0)
#define	ADC_GCOMP_GCOMPCOEFF_0			(0x1u<<0)

#define	ADC_GCOMP_GCOMP_B_0X0			(0x0u<<31)
#define	ADC_GCOMP_GCOMP_B_0X1			(0x1u<<31)
#define	ADC_GCOMP_GCOMPCOEFF_B_0X800	(0x800u<<0)
#define	ADC_GCOMP_GCOMPCOEFF_B_0X1000	(0x1000u<<0)
#define	ADC_GCOMP_GCOMPCOEFF_B_0X2000	(0x2000u<<0)
#define	ADC_GCOMP_GCOMPCOEFF_B_0X3000	(0x3000u<<0)

// JDR1 Configuration

#define	ADC_JDR1_JDATA					(0xFFFFFFFFu<<0)
#define	ADC_JDR1_JDATA_0				(0x1u<<0)

// JDR2 Configuration

#define	ADC_JDR2_JDATA					(0xFFFFFFFFu<<0)
#define	ADC_JDR2_JDATA_0				(0x1u<<0)

// JDR3 Configuration

#define	ADC_JDR3_JDATA					(0xFFFFFFFFu<<0)
#define	ADC_JDR3_JDATA_0				(0x1u<<0)

// JDR4 Configuration

#define	ADC_JDR4_JDATA					(0xFFFFFFFFu<<0)
#define	ADC_JDR4_JDATA_0				(0x1u<<0)

// AWD2CR Configuration

#define	ADC_AWD2CR_AWD2CH				(0xFFFFFu<<0)
#define	ADC_AWD2CR_AWD2CH_0				(0x1u<<0)

// AWD3CR Configuration

#define	ADC_AWD3CR_AWD3CH				(0xFFFFFu<<0)
#define	ADC_AWD3CR_AWD3CH_0				(0x1u<<0)

// AWD1LTR Configuration

#define	ADC_AWD1LTR_LTR					(0x7FFFFFu<<0)
#define	ADC_AWD1LTR_LTR_0				(0x1u<<0)

// AWD1HTR Configuration

#define	ADC_AWD1HTR_AWDFILT				(0x7u<<29)
#define	ADC_AWD1HTR_AWDFILT_0			(0x1u<<29)
#define	ADC_AWD1HTR_HTR					(0x7FFFFFu<<0)
#define	ADC_AWD1HTR_HTR_0				(0x1u<<0)

#define	ADC_AWD1HTR_AWDFILT_B_0X0		(0x0u<<29)
#define	ADC_AWD1HTR_AWDFILT_B_0X1		(0x1u<<29)
#define	ADC_AWD1HTR_AWDFILT_B_0X7		(0x7u<<29)

// AWD2LTR Configuration

#define	ADC_AWD2LTR_LTR					(0x7FFFFFu<<0)
#define	ADC_AWD2LTR_LTR_0				(0x1u<<0)

// AWD2HTR Configuration

#define	ADC_AWD2HTR_HTR					(0x7FFFFFu<<0)
#define	ADC_AWD2HTR_HTR_0				(0x1u<<0)

// AWD3LTR Configuration

#define	ADC_AWD3LTR_LTR					(0x7FFFFFu<<0)
#define	ADC_AWD3LTR_LTR_0				(0x1u<<0)

// AWD3HTR Configuration

#define	ADC_AWD3HTR_HTR					(0x7FFFFFu<<0)
#define	ADC_AWD3HTR_HTR_0				(0x1u<<0)

// DIFSEL Configuration

#define	ADC_DIFSEL_DIFSEL				(0xFFFFFu<<0)
#define	ADC_DIFSEL_DIFSEL_0				(0x1u<<0)

// CALFACT Configuration

#define	ADC_CALFACT_CALADDOS			(0x1u<<31)
#define	ADC_CALFACT_CALFACT_D			(0x1FFu<<16)
#define	ADC_CALFACT_CALFACT_D_0			(0x1u<<16)
#define	ADC_CALFACT_CALFACT_S			(0x1FFu<<0)
#define	ADC_CALFACT_CALFACT_S_0			(0x1u<<0)

#define	ADC_CALFACT_CALADDOS_B_0X0		(0x0u<<31)
#define	ADC_CALFACT_CALADDOS_B_0X1		(0x1u<<31)

// OR Configuration

#define	ADC_OR_VDDCOREEN				(0x1u<<2)
#define	ADC_OR_SELBG					(0x1u<<1)
#define	ADC_OR_SELREF					(0x1u<<0)

#define	ADC_OR_VDDCOREEN_B_0X0			(0x0u<<2)
#define	ADC_OR_VDDCOREEN_B_0X1			(0x1u<<2)
#define	ADC_OR_SELBG_B_0X0				(0x0u<<1)
#define	ADC_OR_SELBG_B_0X1				(0x1u<<1)
#define	ADC_OR_SELREF_B_0X0				(0x0u<<0)
#define	ADC_OR_SELREF_B_0X1				(0x1u<<0)
